ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
/*
 * main.c — FreeRTOS Hello World on PIC32MK QEMU
 *
 * Creates one task that prints "Hello from FreeRTOS!\r\n" every second.
 * Timer1 drives the FreeRTOS tick at 1 kHz (the default port configuration).
 *
 * Copyright (c) 2026 QEMU contributors
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include <stdarg.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#ifdef snprintf
#undef snprintf
#endif

#ifdef vsnprintf
#undef vsnprintf
#endif
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "xc.h"
#include "plib_evic.h"
#include "plib_uart1.h"
#include "plib_wdt.h"
#include "plib_uart2.h"
#include "plib_canfd1.h"
#include "plib_canfd2.h"
#include "plib_canfd3.h"
#include "plib_canfd4.h"
#include "plib_clk.h"
#include "usb_init.h"
#include "plib_gpio.h"
#include "plib_adchs.h"
#include "plib_eeprom.h"
#include "plib_nvm.h"
#include "plib_ocmp1.h"
#include "plib_ocmp2.h"
#include "plib_ocmp3.h"
#include "plib_icap2.h"
#include "plib_spi5_slave.h"

/* -----------------------------------------------------------------------
 * UART1 TX helpers — thin wrappers around plib UART1_Write()
 * ----------------------------------------------------------------------- */

static void uart1_putc(char c)
{
    uint8_t byte = (uint8_t)c;
    while (UART1_WriteFreeBufferCountGet() == 0U)
    { /* spin */
    }
    UART1_Write(&byte, 1);
}

static void uart1_write_all(const char *buf, size_t len)
{
    while (len > 0U)
    {
        size_t n = UART1_Write((uint8_t *)(uintptr_t)buf, len);
        buf += n;
        len -= n;
    }
}

static void uart1_puts(const char *s)
{
    uart1_write_all(s, strlen(s));
}

int printf(const char *format, ...)
{
    char buf[192];
    int written;
    size_t len;
    va_list args;

    va_start(args, format);
    written = vsnprintf(buf, sizeof(buf), format, args);
    va_end(args);

    if (written < 0)
    {
        return written;
    }

    len = (size_t)written;
    if (len >= sizeof(buf))
    {
        len = sizeof(buf) - 1U;
    }

    uart1_write_all(buf, len);
    return written;
}


/* -----------------------------------------------------------------------
 * FreeRTOS application hooks
 * ----------------------------------------------------------------------- */

void vApplicationMallocFailedHook(void)
{
    uart1_puts("FATAL: malloc failed\r\n");
    for (;;)
    {
    }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    (void)xTask;
    (void)pcTaskName;
    uart1_puts("FATAL: stack overflow\r\n");
    for (;;)
    {
    }
}

void vApplicationIdleHook(void)
{
    /* Kick the watchdog each idle cycle to prevent timeout. */
    WDT_Clear();
    /* Halt the CPU until the next interrupt (e.g. Timer1 tick).
     * This lets QEMU's TCG thread sleep instead of busy-looping. */
    __asm__ __volatile__("wait");
}

/* -----------------------------------------------------------------------
 * Hello World task
 * ----------------------------------------------------------------------- */

static void vHelloTask(void *pvParam)
{
    (void)pvParam;
    for (;;)
    {
        uint32_t ms = xTaskGetTickCount() * portTICK_PERIOD_MS;
        uint32_t s = ms / 1000;
        uint32_t m = s / 60;
        s %= 60;
        uint32_t h = m / 60;
        m %= 60;
        printf("[%02lu:%02lu:%02lu] Hello from FreeRTOS!\r\n",
               (unsigned long)h,
               (unsigned long)m,
               (unsigned long)s);
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

static void vPingTask(void *pvParam)
{
    (void)pvParam;
    for (;;)
    {
        uart1_puts("Ping\r\n");
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

/* -----------------------------------------------------------------------
 * CAN TX task — sends a 5-byte "hello" frame on CAN1 TX Queue every 3s
 * ----------------------------------------------------------------------- */

static void vCanTxTask(void *pvParam)
{
    (void)pvParam;
    static const uint8_t hello_payload[] = "hello";
    uint32_t count = 0;
    for (;;)
    {
        vTaskDelay(pdMS_TO_TICKS(3000));
        count++;
         printf("[CAN] TX #%lu id=0x100 data='hello'\r\n",
             (unsigned long)count);
        bool ok = CAN1_MessageTransmit(
            0x100U, 5U, (uint8_t *)(uintptr_t)hello_payload,
            0U,                /* TX Queue (fifoQueueNum=0) */
            CANFD_MODE_NORMAL, /* classic CAN, no BRS */
            CANFD_MSG_TX_DATA_FRAME);
        if (!ok)
        {
            uart1_puts("[CAN] TX queue full\r\n");
        }
    }
}

/* -----------------------------------------------------------------------
 * CAN4 RX task — interrupt-driven receive via FreeRTOS queue
 *
 * plib_canfd4 uses FIFO2 for RX.  can4_rx_callback() is called from
 * CAN4_InterruptHandler (ISR context) after the plib fills the static
 * receive buffer.  We copy the frame into the queue and re-arm the plib.
 * ----------------------------------------------------------------------- */

typedef struct
{
    uint32_t id;
    uint8_t length;
    uint8_t data[8];
} CAN4Frame_t;

/* -----------------------------------------------------------------------
 * CAN1 RX task — interrupt-driven receive via FreeRTOS queue
 *
 * plib_canfd1 uses FIFO2 for RX.  can1_rx_callback() is called from
 * CAN1_InterruptHandler (ISR context) after the plib fills the static
 * receive buffer.  We copy the frame into the queue and re-arm the plib.
 * ----------------------------------------------------------------------- */

typedef struct
{
    uint32_t id;
    uint8_t length;
    uint8_t data[8];
} CAN1Frame_t;

static QueueHandle_t xCan1RxQueue;

static uint32_t can1_rx_id;
static uint8_t can1_rx_len;
static uint8_t can1_rx_data[8];
static uint32_t can1_rx_ts;
static CANFD_MSG_RX_ATTRIBUTE can1_rx_attr;

static void can1_rx_callback(uintptr_t context)
{
    (void)context;
    CAN1Frame_t frame;
    uint8_t i;
    frame.id = can1_rx_id;
    frame.length = can1_rx_len;
    for (i = 0; i < can1_rx_len && i < 8U; i++)
    {
        frame.data[i] = can1_rx_data[i];
    }
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendToBackFromISR(xCan1RxQueue, &frame, &xHigherPriorityTaskWoken);
    /* Re-arm: register buffer for the next incoming frame */
    CAN1_MessageReceive(&can1_rx_id, &can1_rx_len, can1_rx_data,
                        &can1_rx_ts, 2U, &can1_rx_attr);
    /* Yield handled by portRESTORE_CONTEXT in vCAN1InterruptWrapper */
}

static void vCan1RxTask(void *pvParam)
{
    (void)pvParam;
    CAN1Frame_t frame;
    for (;;)
    {
        if (xQueueReceive(xCan1RxQueue, &frame, portMAX_DELAY) == pdTRUE)
        {
            uint8_t i;
            printf("[CAN1 RX] id=0x%08lX len=%u data=",
                   (unsigned long)frame.id,
                   (unsigned int)frame.length);
            for (i = 0; i < frame.length && i < 8U; i++)
            {
                printf("%02X", (unsigned int)frame.data[i]);
            }
            printf("\r\n");
        }
    }
}

static QueueHandle_t xCan4RxQueue;

static uint32_t can4_rx_id;
static uint8_t can4_rx_len;
static uint8_t can4_rx_data[8];
static uint32_t can4_rx_ts;
static CANFD_MSG_RX_ATTRIBUTE can4_rx_attr;

static void can4_rx_callback(uintptr_t context)
{
    (void)context;
    CAN4Frame_t frame;
    uint8_t i;
    frame.id = can4_rx_id;
    frame.length = can4_rx_len;
    for (i = 0; i < can4_rx_len && i < 8U; i++)
    {
        frame.data[i] = can4_rx_data[i];
    }
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendToBackFromISR(xCan4RxQueue, &frame, &xHigherPriorityTaskWoken);
    /* Re-arm: register buffer for the next incoming frame */
    CAN4_MessageReceive(&can4_rx_id, &can4_rx_len, can4_rx_data,
                        &can4_rx_ts, 2U, &can4_rx_attr);
    /* Yield handled by portRESTORE_CONTEXT in vCAN4InterruptWrapper */
}

static void vCan4RxTask(void *pvParam)
{
    (void)pvParam;
    CAN4Frame_t frame;
    for (;;)
    {
        if (xQueueReceive(xCan4RxQueue, &frame, portMAX_DELAY) == pdTRUE)
        {
            uint8_t i;
            printf("[CAN4 RX] id=0x%lX len=%u data='",
                   (unsigned long)frame.id,
                   (unsigned int)frame.length);
            for (i = 0; i < frame.length && i < 8U; i++)
            {
                uart1_putc((char)frame.data[i]);
            }
            printf("'\r\n");
        }
    }
}

/* -----------------------------------------------------------------------
 * UART2 RX queue and callback
 *
 * xUart2RxQueue holds individual bytes received on UART2.
 * uart2_rx_callback() is called from UART2_RX_InterruptHandler (ISR
 * context) whenever the plib RX threshold (1 byte) is reached.
 * portRESTORE_CONTEXT in the ISR wrapper always calls vTaskSwitchContext,
 * so the consumer task is woken up on the next scheduler pass.
 * ----------------------------------------------------------------------- */

