ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
static QueueHandle_t xUart2RxQueue;

static void uart2_rx_callback(UART_EVENT event, uintptr_t context)
{
    (void)context;
    if (event != UART_EVENT_READ_THRESHOLD_REACHED)
    {
        return;
    }

    uint8_t byte;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    while (UART2_Read(&byte, 1) == 1)
    {
        xQueueSendToBackFromISR(xUart2RxQueue, &byte, &xHigherPriorityTaskWoken);
    }
    /* Yield is handled by portRESTORE_CONTEXT in vUART2RXInterruptWrapper */
}

/* -----------------------------------------------------------------------
 * UART2 consumer task
 *
 * Blocks on the queue until a byte arrives, then echoes it on UART1
 * as: "[U2] <hex> '<ch>'\r\n"
 * ----------------------------------------------------------------------- */

static void vUart2ConsumerTask(void *pvParam)
{
    (void)pvParam;
    for (;;)
    {
        uint8_t byte;
        if (xQueueReceive(xUart2RxQueue, &byte, portMAX_DELAY) == pdTRUE)
        {
            printf("[U2] 0x%02X '%c'\r\n",
                   (unsigned int)byte,
                   (char)byte);
        }
    }
}

/* -----------------------------------------------------------------------
 * USB CDC TX task
 *
 * Waits 3 s for USB enumeration, then sends "[CDC] Hello #N\r\n" every
 * second.  Uses USB_SendFrame() which is non-blocking.
 * ----------------------------------------------------------------------- */

static void vUsbCdcTask(void *pvParam)
{
    (void)pvParam;
    static uint8_t s_buf[48];
    uint32_t count = 0;

    /* Wait for host to enumerate the device */
    vTaskDelay(pdMS_TO_TICKS(3000));

    for (;;)
    {
        int len;

        count++;

        len = snprintf((char *)s_buf, sizeof(s_buf),
                       "[CDC] Hello #%lu\r\n",
                       (unsigned long)count);

        /* Retry until accepted (USB may still be busy from previous TX) */
        if (len > 0)
        {
            size_t tx_len = (size_t)len;
            if (tx_len >= sizeof(s_buf))
            {
                tx_len = sizeof(s_buf) - 1U;
            }
            while (!USB_SendFrame(s_buf, tx_len))
            {
                vTaskDelay(pdMS_TO_TICKS(10));
            }
        }

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* -----------------------------------------------------------------------
 * GPIO Port A tasks
 *
 * Pin assignment from plib_gpio.h (VOLTU hardware):
 *   RA15 (GPO_GND_DIFF_LOCK) — digital output, configured by GPIO_Initialize()
 *   RA7  (SPI_EN)            — digital input with CN, configured by GPIO_Initialize()
 *
 * vGpioBlinkTask   — toggles RA15 every 500 ms
 * vGpioMonitorTask — waits for CN interrupt on RA7, prints state change
 *
 * Host-side workflow (requires QEMU launched with -qmp socket):
 *   python3 gpio_tool.py --qmp /tmp/qemu-qmp.sock set A 7 1
 *   python3 gpio_tool.py --qmp /tmp/qemu-qmp.sock set A 7 0
 *   python3 gpio_tool.py --qmp /tmp/qemu-qmp.sock get-port A
 * ----------------------------------------------------------------------- */

static SemaphoreHandle_t xGpioCnSemaphore;

static void gpio_ra7_callback(GPIO_PIN pin, uintptr_t context)
{
    (void)pin;
    (void)context;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(xGpioCnSemaphore, &xHigherPriorityTaskWoken);
}

static void vGpioBlinkTask(void *pvParam)
{
    (void)pvParam;

    /* RA15 (GPO_GND_DIFF_LOCK): configured as digital output by GPIO_Initialize()
     * (ANSELACLR = 0xd803 clears bit 15, TRISACLR = 0xc401 clears bit 15) */
    uart1_puts("[GPIO] RA15 blink started (500ms toggle)\r\n");

    for (;;)
    {
        GPO_GND_DIFF_LOCK_Toggle();
        vTaskDelay(pdMS_TO_TICKS(50));
    }
}

static void vGpioMonitorTask(void *pvParam)
{
    (void)pvParam;
    uint8_t prev_ra7 = 0;

    /* RA7 (SPI_EN): input-only pin on port A.
     * GPIO_Initialize() already enabled CNCON.ON and IEC1.CNAIE.
     * We just register the callback and enable per-pin CN detection. */
    xGpioCnSemaphore = xSemaphoreCreateBinary();
    GPIO_PinInterruptCallbackRegister(SPI_EN_PIN, gpio_ra7_callback, 0);
    GPIO_PinIntEnable(SPI_EN_PIN, GPIO_INTERRUPT_ON_BOTH_EDGES);

    uart1_puts("[GPIO] RA7 (SPI_EN) CN interrupt monitor started\r\n");
    uart1_puts("[GPIO] Inject: gpio_tool.py set A 7 1\r\n");

    for (;;)
    {
        xSemaphoreTake(xGpioCnSemaphore, portMAX_DELAY);

        uint8_t ra7 = (uint8_t)SPI_EN_Get();

        if (ra7 != prev_ra7)
        {
            if (ra7)
            {
                uart1_puts("[GPIO] RA7: LOW -> HIGH (rising edge)\r\n");
            }
            else
            {
                uart1_puts("[GPIO] RA7: HIGH -> LOW (falling edge)\r\n");
            }
            prev_ra7 = ra7;
        }
    }
}

/* -----------------------------------------------------------------------
 * ADC Monitor task — reads CH15 (TEMP_MOTOR) via EOS interrupt
 * ----------------------------------------------------------------------- */

static SemaphoreHandle_t xAdcEosSemaphore;

static void adc_eos_callback(uintptr_t context)
{
    (void)context;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(xAdcEosSemaphore, &xHigherPriorityTaskWoken);
}

static void vAdcMonitorTask(void *pvParam)
{
    (void)pvParam;

    xAdcEosSemaphore = xSemaphoreCreateBinary();
    ADCHS_EOSCallbackRegister(adc_eos_callback, 0);

    uart1_puts("[ADC] CH15 (TEMP_MOTOR) monitor started\r\n");
    uart1_puts("[ADC] Inject: gpio_tool.py adc-set 15 2048\r\n");

    for (;;)
    {
        /* Trigger a global software edge conversion */
        ADCHS_GlobalEdgeConversionStart();

        /* Wait for End-of-Scan interrupt */
        xSemaphoreTake(xAdcEosSemaphore, portMAX_DELAY);

        /* Read channel 15 result */
        if (ADCHS_ChannelResultIsReady(ADCHS_CH15))
        {
            uint32_t result = ADCHS_ChannelResultGet(ADCHS_CH15);
            printf("[ADC] CH15 = %lu\r\n", (unsigned long)result);
        }

        vTaskDelay(pdMS_TO_TICKS(10000));
    }
}

/* -----------------------------------------------------------------------
 * EEPROM Test task — exercises Data EEPROM via Harmony plib
 *
 * Sequence: init -> write 4 words -> read back & verify -> page erase ->
 *           verify erased -> bulk erase -> done.
 * Prints PASS/FAIL for each step.
 * ----------------------------------------------------------------------- */

