ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
static void vEepromTestTask(void *pvParam)
{
    (void)pvParam;

    uart1_puts("[EE] EEPROM test starting...\r\n");

    /* --- Write 4 words at addresses 0x000, 0x004, 0x008, 0x00C --- */
    static const uint32_t test_addr[] = { 0x000, 0x004, 0x008, 0x00C };
    static const uint32_t test_data[] = { 0xDEADBEEF, 0xCAFEBABE, 0x12345678, 0xA5A5A5A5 };
    uint32_t i;
    bool ok;

    for (i = 0; i < 4; i++) {
        ok = EEPROM_WordWrite(test_addr[i], test_data[i]);
        if (!ok) {
            printf("[EE] FAIL: WordWrite addr=0x%08lX\r\n",
                   (unsigned long)test_addr[i]);
        }
    }

    EEPROM_ERROR err = EEPROM_ErrorGet();
    if (err != EEPROM_ERROR_NONE) {
        printf("[EE] FAIL: ErrorGet after writes = 0x%08lX\r\n",
               (unsigned long)err);
    }

    /* --- Read back and verify --- */
    uint32_t pass_count = 0;
    for (i = 0; i < 4; i++) {
        uint32_t readback = 0;
        ok = EEPROM_WordRead(test_addr[i], &readback);
        if (!ok) {
            printf("[EE] FAIL: WordRead addr=0x%08lX\r\n",
                   (unsigned long)test_addr[i]);
        } else if (readback != test_data[i]) {
            printf("[EE] FAIL: addr=0x%08lX expected=0x%08lX got=0x%08lX\r\n",
                   (unsigned long)test_addr[i],
                   (unsigned long)test_data[i],
                   (unsigned long)readback);
        } else {
            pass_count++;
        }
    }
    printf("[EE] Write/Read: %lu/4 PASS\r\n", (unsigned long)pass_count);


    /* --- Page erase (page 0 = addresses 0x000..0x07C) --- */
    ok = EEPROM_PageErase(0x000);
    if (!ok) {
        uart1_puts("[EE] FAIL: PageErase\r\n");
    }
    /* Verify erased (should read 0xFFFFFFFF) */
    pass_count = 0;
    for (i = 0; i < 4; i++) {
        uint32_t readback = 0;
        ok = EEPROM_WordRead(test_addr[i], &readback);
        if (ok && readback == 0xFFFFFFFFu) {
            pass_count++;
        } else {
            printf("[EE] FAIL: post-erase addr=0x%08lX got=0x%08lX\r\n",
                   (unsigned long)test_addr[i],
                   (unsigned long)readback);
        }
    }
    printf("[EE] PageErase: %lu/4 PASS\r\n", (unsigned long)pass_count);

    /* --- Bulk erase test: write one word, bulk erase, verify --- */
    EEPROM_WordWrite(0x100, 0xBAADF00Du);
    ok = EEPROM_BulkErase();
    if (!ok) {
        uart1_puts("[EE] FAIL: BulkErase\r\n");
    }
    {
        uint32_t readback = 0;
        EEPROM_WordRead(0x100, &readback);
        if (readback == 0xFFFFFFFFu) {
            uart1_puts("[EE] BulkErase: PASS\r\n");
        } else {
            printf("[EE] BulkErase: FAIL got=0x%08lX\r\n",
                   (unsigned long)readback);
        }
    }

    uart1_puts("[EE] EEPROM test complete.\r\n");

    /* Task done — suspend forever */
    vTaskSuspend(NULL);
}

/* -----------------------------------------------------------------------
 * NVM (Program Flash) Test task — uses Harmony plib API
 *
 * Exercises the QEMU NVM controller via the unmodified Harmony plib
 * (NVM_WordWrite, NVM_QuadWordWrite, NVM_PageErase, NVM_Read).
 * The plib enables IEC0[31] after each operation; the NVM ISR
 * (NVM_InterruptHandler) clears IFS0[31] so FreeRTOS keeps running.
 *
 * Test sequence: word write ×4 -> read back -> quad-word write ->
 *                read back -> page erase -> verify erased.
 * Uses the last page of program flash (NVM_FLASH_START_ADDRESS + 0xFF000).
 * ----------------------------------------------------------------------- */

static void vNvmTestTask(void *pvParam)
{
    (void)pvParam;

    const uint32_t test_base = NVM_FLASH_START_ADDRESS + 0xFF000u;

    uart1_puts("[NVM] NVM test starting...\r\n");

    /* --- Word write ×4 --- */
    static const uint32_t test_data[] = {
        0xDEADBEEFu, 0xCAFEBABEu, 0x12345678u, 0xA5A5A5A5u
    };
    uint32_t i;

    for (i = 0; i < 4; i++) {
        NVM_WordWrite(test_data[i], test_base + i * 4u);
        while (NVM_IsBusy()) { }
    }

    if (NVM_ErrorGet() != NVM_ERROR_NONE) {
        printf("[NVM] FAIL: error after writes = 0x%08lX\r\n",
               (unsigned long)NVM_ErrorGet());
    }

    /* --- Read back via NVM_Read and verify --- */
    uint32_t rbuf[4];
    NVM_Read(rbuf, sizeof(rbuf), test_base);

    uint32_t pass_count = 0;
    for (i = 0; i < 4; i++) {
        if (rbuf[i] != test_data[i]) {
            printf("[NVM] FAIL: word[%lu] expected=0x%08lX got=0x%08lX\r\n",
                   (unsigned long)i,
                   (unsigned long)test_data[i],
                   (unsigned long)rbuf[i]);
        } else {
            pass_count++;
        }
    }
    printf("[NVM] Write/Read: %lu/4 PASS\r\n", (unsigned long)pass_count);

    /* --- Quad-word write at offset 0x10 (16-byte aligned) --- */
    {
        static const uint32_t qw_data[4] = {
            0x11223344u, 0x55667788u, 0x99AABBCCu, 0xDDEEFF00u
        };
        NVM_QuadWordWrite((uint32_t *)qw_data, test_base + 0x10u);
        while (NVM_IsBusy()) { }

        uint32_t qbuf[4];
        NVM_Read(qbuf, sizeof(qbuf), test_base + 0x10u);

        if (qbuf[0] == qw_data[0] && qbuf[1] == qw_data[1] &&
            qbuf[2] == qw_data[2] && qbuf[3] == qw_data[3]) {
            uart1_puts("[NVM] QuadWord: PASS\r\n");
        } else {
            printf("[NVM] QuadWord: FAIL got=0x%08lX 0x%08lX 0x%08lX 0x%08lX\r\n",
                   (unsigned long)qbuf[0],
                   (unsigned long)qbuf[1],
                   (unsigned long)qbuf[2],
                   (unsigned long)qbuf[3]);
        }
    }

    /* --- Page erase (erases 4 KB at test_base) --- */
    NVM_PageErase(test_base);
    while (NVM_IsBusy()) { }

    /* Verify erased (should read 0xFFFFFFFF) */
    NVM_Read(rbuf, sizeof(rbuf), test_base);

    pass_count = 0;
    for (i = 0; i < 4; i++) {
        if (rbuf[i] == 0xFFFFFFFFu) {
            pass_count++;
        } else {
            printf("[NVM] FAIL: post-erase word[%lu] got=0x%08lX\r\n",
                   (unsigned long)i,
                   (unsigned long)rbuf[i]);
        }
    }
    printf("[NVM] PageErase: %lu/4 PASS\r\n", (unsigned long)pass_count);

    uart1_puts("[NVM] NVM test complete.\r\n");

    /* Task done — suspend forever */
    vTaskSuspend(NULL);
}

/* -----------------------------------------------------------------------
 * Output Compare demo task — exercises OC1 (PWM), OC2 (single pulse),
 * OC3 (continuous pulses) via Harmony OCMP plib API.
 * ----------------------------------------------------------------------- */

static void vOcDemoTask(void *pvParam)
{
    (void)pvParam;
    vTaskDelay(pdMS_TO_TICKS(2000));  /* Let other init messages print first */

    uart1_puts("[OC] Output Compare demo starting...\r\n");

    /* --- OC1: PWM mode (OCM=110, default from OCMP1_Initialize) --- */
    OCMP1_Initialize();                      /* Sets OC1CON=0x6 (PWM no fault) */
    OCMP1_CompareSecondaryValueSet(0x7FFF);  /* 50% duty: OCxRS = PR2/2 = 0xFFFF/2 */
    OCMP1_Enable();                          /* OC1CONSET = ON */
    uart1_puts("[OC] OC1: PWM mode (plib), duty=50%\r\n");

