ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
    vTaskDelay(pdMS_TO_TICKS(500));

    /* --- OC2: Single pulse (OCM=100) ---
     * OCMP2_Initialize() sets OCM=6 (PWM) by default, so we override
     * to mode 4 (single pulse) via direct register write after init. */
    OCMP2_Initialize();
    OC2CON = 0x0004;                          /* OCM=100 (single pulse) */
    OC2R   = 0x0100;                          /* Primary compare */
    OCMP2_CompareSecondaryValueSet(0x0500);   /* Secondary compare */
    OCMP2_Enable();
    uart1_puts("[OC] OC2: Single pulse mode, R=0x100 RS=0x500\r\n");

    vTaskDelay(pdMS_TO_TICKS(500));

    /* --- OC3: Continuous pulses (OCM=101) --- */
    OCMP3_Initialize();
    OC3CON = 0x0005;                          /* OCM=101 (continuous pulses) */
    OC3R   = 0x0200;
    OCMP3_CompareSecondaryValueSet(0x0800);
    OCMP3_Enable();
    uart1_puts("[OC] OC3: Continuous pulse mode\r\n");

    vTaskDelay(pdMS_TO_TICKS(500));

    /* --- Disable all via plib --- */
    OCMP1_Disable();
    OCMP2_Disable();
    OCMP3_Disable();
    uart1_puts("[OC] All OC modules disabled\r\n");
    uart1_puts("[OC] Output Compare demo complete.\r\n");

    vTaskSuspend(NULL);
}

/* -----------------------------------------------------------------------
 * Input Capture demo task — exercises IC2 via Harmony ICAP2 plib
 *
 * ICAP2_Initialize() enables IEC0 IC2IE + IC2EIE; the capture ISR
 * (INPUT_CAPTURE_2_InterruptHandler) calls the registered callback which
 * signals this task via semaphore.  Inject captures using the QEMU
 * ic-events chardev: write 8-byte packets as described in pic32mk_ic.c.
 * ----------------------------------------------------------------------- */

static SemaphoreHandle_t xIc2Semaphore;
static volatile uint16_t ic2_last_capture;

static void ic2_capture_callback(uintptr_t context)
{
    (void)context;
    ic2_last_capture = ICAP2_CaptureBufferRead();
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(xIc2Semaphore, &xHigherPriorityTaskWoken);
}

static void vIcapDemoTask(void *pvParam)
{
    (void)pvParam;

    xIc2Semaphore = xSemaphoreCreateBinary();

    ICAP2_CallbackRegister(ic2_capture_callback, 0);
    ICAP2_Initialize();   /* IC2CON = 0x1, enables IEC0 IC2IE + IC2EIE */
    ICAP2_Enable();       /* IC2CONSET = ON */

    uart1_puts("[ICAP] IC2 armed (IRQ mode, ICM=1 every edge)\r\n");

    for (;;)
    {
        xSemaphoreTake(xIc2Semaphore, portMAX_DELAY);
        uint16_t val = ic2_last_capture;
        printf("[ICAP] IC2 captured 0x%04X\r\n", (unsigned int)val);
    }
}

/* -----------------------------------------------------------------------
 * SPI5 Slave demo — receive HELLO from host and reply with WORLD
 * ----------------------------------------------------------------------- */

static void vSpi5SlaveTask(void *pvParam)
{
    (void)pvParam;
    static const uint8_t reply[] = "WORLD";
    uint8_t buf[64];

    uart1_puts("[SPI5] Slave demo ready (send HELLO over socket)\r\n");

    /* Preload the response buffer for MISO */
    (void)SPI5_Write((void *)(uintptr_t)reply, sizeof(reply) - 1U);

    for (;;)
    {
        size_t count = SPI5_ReadCountGet();
        if (count > 0U)
        {
            if (count > sizeof(buf))
            {
                count = sizeof(buf);
            }
            (void)SPI5_Read(buf, count);
            printf("[SPI5] RX '");
            for (size_t i = 0; i < count; i++)
            {
                uart1_putc((char)buf[i]);
            }
            printf("'\r\n");

            /* Refill reply buffer after each transfer */
            (void)SPI5_Write((void *)(uintptr_t)reply, sizeof(reply) - 1U);
        }
        vTaskDelay(pdMS_TO_TICKS(50));
    }
}

/* -----------------------------------------------------------------------
 * main
 * ----------------------------------------------------------------------- */

int main(void)
{
    CLK_Initialize();
    EVIC_Initialize();
    UART1_Initialize();
    UART2_Initialize();
    CAN1_Initialize();
    CAN4_Initialize();
    USB1_Initialize();
    GPIO_Initialize();
    ADCHS_Initialize();
    EEPROM_Initialize();
    NVM_Initialize();
    WDT_Enable();
    SPI5_Initialize();

    uart1_puts("PIC32MK QEMU booting FreeRTOS...\r\n");
    uart1_puts("UART2 RX -> FreeRTOS queue -> consumer task\r\n");
    uart1_puts("SPI5 slave ready on chardev 'spi5'\r\n");

    /* Queue for CAN1 RX frames (depth = 16) */
    xCan1RxQueue = xQueueCreate(16, sizeof(CAN1Frame_t));
    CAN1_CallbackRegister(can1_rx_callback, 0, 2U); /* FIFO2 = RX */
    CAN1_MessageReceive(&can1_rx_id, &can1_rx_len, can1_rx_data,
                        &can1_rx_ts, 2U, &can1_rx_attr);

    /* Queue for CAN4 RX frames (depth = 16) */
    xCan4RxQueue = xQueueCreate(16, sizeof(CAN4Frame_t));
    CAN4_CallbackRegister(can4_rx_callback, 0, 2U); /* FIFO2 = RX */
    CAN4_MessageReceive(&can4_rx_id, &can4_rx_len, can4_rx_data,
                        &can4_rx_ts, 2U, &can4_rx_attr);

    /* Queue for bytes received on UART2 (depth = 64 bytes) */
    xUart2RxQueue = xQueueCreate(64, sizeof(uint8_t));

    /* Register UART2 RX callback: notify per byte, non-persistent */
    UART2_ReadCallbackRegister(uart2_rx_callback, 0);
    UART2_ReadThresholdSet(10);
    UART2_ReadNotificationEnable(true, false);

    xTaskCreate(vHelloTask, "Hello", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vPingTask, "Ping", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vUart2ConsumerTask, "U2Rx", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL); /* higher priority so it runs immediately */
    xTaskCreate(vCanTxTask, "CAN", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vCan1RxTask, "C1Rx", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vCan4RxTask, "C4Rx", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vUsbDeviceTask, "USB", 512,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vUsbCdcTask, "CDC", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vGpioBlinkTask, "Blink", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vGpioMonitorTask, "GpioMon", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vAdcMonitorTask, "ADC", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vEepromTestTask, "EE", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vNvmTestTask, "NVM", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vOcDemoTask, "OC", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vIcapDemoTask, "ICAP", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vSpi5SlaveTask, "SPI5", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);

    vTaskStartScheduler();

    /* Should never reach here */
    uart1_puts("ERROR: scheduler returned\r\n");
    for (;;)
    {
    }
}
